‡πÇ‡∏à‡∏ó‡∏¢‡πå‡∏ä‡∏∏‡∏î‡∏ô‡∏µ‡πâ‡∏à‡∏∞‡πÄ‡∏ô‡πâ‡∏ô‡∏Å‡∏≤‡∏£ "‡∏ó‡∏≥‡∏Ñ‡∏ß‡∏≤‡∏°‡∏™‡∏∞‡∏≠‡∏≤‡∏î‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•" (Data Cleaning) ‡∏Å‡πà‡∏≠‡∏ô‡πÄ‡∏≠‡∏≤‡πÑ‡∏õ‡πÉ‡∏ä‡πâ‡∏á‡∏≤‡∏ô‡∏Ñ‡∏£‡∏±‡∏ö

üõ†Ô∏è ‡∏Ç‡∏±‡πâ‡∏ô‡∏ï‡∏≠‡∏ô‡∏ó‡∏µ‡πà 1: ‡πÄ‡∏ï‡∏£‡∏µ‡∏¢‡∏°‡∏ä‡∏∏‡∏î‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡∏ó‡∏µ‡πà "‡πÄ‡∏•‡∏∞‡πÄ‡∏ó‡∏∞" (Messy Data)
‡∏£‡∏±‡∏ô‡πÇ‡∏Ñ‡πâ‡∏î‡∏ô‡∏µ‡πâ‡πÄ‡∏û‡∏∑‡πà‡∏≠‡∏™‡∏£‡πâ‡∏≤‡∏á‡∏õ‡∏±‡∏ç‡∏´‡∏≤‡πÉ‡∏´‡πâ‡∏õ‡πã‡∏≤‡πÅ‡∏Å‡πâ‡∏Ñ‡∏£‡∏±‡∏ö (‡∏™‡∏±‡∏á‡πÄ‡∏Å‡∏ï‡∏î‡∏µ‡πÜ ‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡∏Ç‡πâ‡∏≤‡∏á‡πÉ‡∏ô‡∏à‡∏∞‡∏°‡∏µ‡∏ä‡πà‡∏≠‡∏á‡∏ß‡πà‡∏≤‡∏á‡πÅ‡∏•‡∏∞‡∏ï‡∏±‡∏ß‡∏û‡∏¥‡∏°‡∏û‡πå‡πÅ‡∏õ‡∏•‡∏Å‡πÜ ‡πÄ‡∏¢‡∏≠‡∏∞‡πÄ‡∏•‡∏¢)

In [1]:
import pandas as pd
import numpy as np

messy_data = {
    'Ticket_ID': ['T01', 'T01', 'T02', 'T03', 'T04', 'T05', 'T06'],
    'User': ['  Somsak  ', 'Somsak', 'mAlEe', '  wichai  ', 'SUDA', 'mana', '  MANA  '],
    'Category': ['H/W', 'Hardware', 'S/W', 'Software', 'Network', 'h/w', 'Software'],
    'Cost': ['1,500', '1500', 'free', '500', '2,500', '1200', '0'],
    'Phone': ['081-222-3333', '0812223333', '081 222 3333', np.nan, '0891112222', '089-111-2222', '0891112222']
}

df_messy = pd.DataFrame(messy_data)
print("‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡∏™‡∏∏‡∏î‡πÄ‡∏•‡∏∞‡∏û‡∏£‡πâ‡∏≠‡∏°‡πÉ‡∏´‡πâ‡∏õ‡πã‡∏≤‡∏Ñ‡∏•‡∏µ‡∏ô‡πÅ‡∏•‡πâ‡∏ß‡∏Ñ‡∏£‡∏±‡∏ö!")
df_messy

‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡∏™‡∏∏‡∏î‡πÄ‡∏•‡∏∞‡∏û‡∏£‡πâ‡∏≠‡∏°‡πÉ‡∏´‡πâ‡∏õ‡πã‡∏≤‡∏Ñ‡∏•‡∏µ‡∏ô‡πÅ‡∏•‡πâ‡∏ß‡∏Ñ‡∏£‡∏±‡∏ö!

  Ticket_ID        User  Category   Cost         Phone
0       T01    Somsak         H/W  1,500  081-222-3333
1       T01      Somsak  Hardware   1500    0812223333
2       T02       mAlEe       S/W   free  081 222 3333
3       T03    wichai    Software    500           NaN
4       T04        SUDA   Network  2,500    0891112222
5       T05        mana       h/w   1200  089-111-2222
6       T06      MANA    Software      0    0891112222

üìù ‡πÇ‡∏à‡∏ó‡∏¢‡πå 10 ‡∏Ç‡πâ‡∏≠ (‡∏õ‡πã‡∏≤‡πÄ‡∏õ‡πá‡∏ô‡∏û‡πà‡∏≠‡∏ö‡πâ‡∏≤‡∏ô‡∏à‡∏±‡∏î‡∏Å‡∏≤‡∏£ Data)
‡∏´‡∏°‡∏ß‡∏î: ‡∏à‡∏±‡∏î‡∏Å‡∏≤‡∏£‡∏ï‡∏±‡∏ß‡∏≠‡∏±‡∏Å‡∏©‡∏£ (String Cleaning)

‡πÇ‡∏à‡∏ó‡∏¢‡πå: ‡∏Ñ‡∏≠‡∏•‡∏±‡∏°‡∏ô‡πå User ‡∏°‡∏µ‡∏ä‡πà‡∏≠‡∏á‡∏ß‡πà‡∏≤‡∏á‡πÄ‡∏¢‡∏≠‡∏∞‡∏°‡∏≤‡∏Å ‡∏à‡∏á‡πÉ‡∏ä‡πâ .str.strip() ‡πÄ‡∏û‡∏∑‡πà‡∏≠‡∏ï‡∏±‡∏î‡∏ä‡πà‡∏≠‡∏á‡∏ß‡πà‡∏≤‡∏á‡∏´‡∏ô‡πâ‡∏≤‡πÅ‡∏•‡∏∞‡∏´‡∏•‡∏±‡∏á‡∏ä‡∏∑‡πà‡∏≠‡∏≠‡∏≠‡∏Å‡πÉ‡∏´‡πâ‡∏´‡∏°‡∏î

In [ ]:
df_messy['User'] = df_messy['User'].str.strip()
df_messy

  Ticket_ID    User  Category  Cost         Phone
0       T01  Somsak       H/W  1500  081-222-3333
1       T01  Somsak  Hardware  1500    0812223333
2       T02   mAlEe       S/W     0  081 222 3333
3       T03  wichai  Software   500           NaN
4       T04    SUDA   Network  2500    0891112222
5       T05    mana       h/w  1200  089-111-2222
6       T06    MANA  Software     0    0891112222


‡πÇ‡∏à‡∏ó‡∏¢‡πå: ‡∏õ‡∏£‡∏±‡∏ö‡∏ä‡∏∑‡πà‡∏≠‡πÉ‡∏ô‡∏Ñ‡∏≠‡∏•‡∏±‡∏°‡∏ô‡πå User ‡πÉ‡∏´‡πâ‡πÄ‡∏õ‡πá‡∏ô‡∏ï‡∏±‡∏ß‡∏û‡∏¥‡∏°‡∏û‡πå‡πÉ‡∏´‡∏ç‡πà‡∏ï‡∏±‡∏ß‡πÅ‡∏£‡∏Å‡∏ó‡∏µ‡πà‡πÄ‡∏´‡∏•‡∏∑‡∏≠‡∏ï‡∏±‡∏ß‡πÄ‡∏•‡πá‡∏Å (Title Case) ‡∏ó‡∏±‡πâ‡∏á‡∏´‡∏°‡∏î (‡∏Ñ‡∏≥‡πÉ‡∏ö‡πâ: .str.title())

In [ ]:
df_messy['User'] = df_messy['User'].str.title()
df_messy

  Ticket_ID    User  Category  Cost         Phone
0       T01  Somsak       H/W  1500  081-222-3333
1       T01  Somsak  Hardware  1500    0812223333
2       T02   Malee       S/W     0  081 222 3333
3       T03  Wichai  Software   500           NaN
4       T04    Suda   Network  2500    0891112222
5       T05    Mana       h/w  1200  089-111-2222
6       T06    Mana  Software     0    0891112222


‡πÇ‡∏à‡∏ó‡∏¢‡πå: ‡πÉ‡∏ô‡∏Ñ‡∏≠‡∏•‡∏±‡∏°‡∏ô‡πå Category ‡∏°‡∏µ‡∏ó‡∏±‡πâ‡∏á 'H/W' ‡πÅ‡∏•‡∏∞ 'h/w' ‡∏à‡∏á‡πÄ‡∏õ‡∏•‡∏µ‡πà‡∏¢‡∏ô‡πÉ‡∏´‡πâ‡πÄ‡∏õ‡πá‡∏ô‡∏Ñ‡∏≥‡∏ß‡πà‡∏≤ 'Hardware' ‡∏ó‡∏±‡πâ‡∏á‡∏´‡∏°‡∏î

In [ ]:
df_messy['Category'] = df_messy['Category'].replace(['H/W', 'h/w'], 'Hardware')
df_messy

  Ticket_ID    User  Category  Cost         Phone
0       T01  Somsak  Hardware  1500  081-222-3333
1       T01  Somsak  Hardware  1500    0812223333
2       T02   Malee       S/W     0  081 222 3333
3       T03  Wichai  Software   500           NaN
4       T04    Suda   Network  2500    0891112222
5       T05    Mana  Hardware  1200  089-111-2222
6       T06    Mana  Software     0    0891112222


‡πÇ‡∏à‡∏ó‡∏¢‡πå: ‡πÉ‡∏ô‡∏Ñ‡∏≠‡∏•‡∏±‡∏°‡∏ô‡πå Category ‡πÄ‡∏õ‡∏•‡∏µ‡πà‡∏¢‡∏ô 'S/W' ‡πÉ‡∏´‡πâ‡πÄ‡∏õ‡πá‡∏ô‡∏Ñ‡∏≥‡∏ß‡πà‡∏≤ 'Software'

In [ ]:
df_messy['Category'] = df_messy['Category'].replace(['S/W'], 'Software')
df_messy

  Ticket_ID    User  Category  Cost         Phone
0       T01  Somsak  Hardware  1500  081-222-3333
1       T01  Somsak  Hardware  1500    0812223333
2       T02   Malee  Software     0  081 222 3333
3       T03  Wichai  Software   500           NaN
4       T04    Suda   Network  2500    0891112222
5       T05    Mana  Hardware  1200  089-111-2222
6       T06    Mana  Software     0    0891112222


‡∏´‡∏°‡∏ß‡∏î: ‡∏à‡∏±‡∏î‡∏Å‡∏≤‡∏£‡∏ï‡∏±‡∏ß‡πÄ‡∏•‡∏Ç‡πÅ‡∏•‡∏∞‡∏™‡∏±‡∏ç‡∏•‡∏±‡∏Å‡∏©‡∏ì‡πå (Formatting) 

5. ‡πÇ‡∏à‡∏ó‡∏¢‡πå: ‡∏Ñ‡∏≠‡∏•‡∏±‡∏°‡∏ô‡πå Cost ‡∏°‡∏µ‡πÄ‡∏Ñ‡∏£‡∏∑‡πà‡∏≠‡∏á‡∏´‡∏°‡∏≤‡∏¢‡∏Ñ‡∏≠‡∏°‡∏°‡πà‡∏≤ (,) ‡πÅ‡∏•‡∏∞‡∏Ñ‡∏≥‡∏ß‡πà‡∏≤ 'free' ‡∏à‡∏á‡πÄ‡∏õ‡∏•‡∏µ‡πà‡∏¢‡∏ô‡∏Ñ‡∏≠‡∏°‡∏°‡πà‡∏≤‡πÄ‡∏õ‡πá‡∏ô‡∏Ñ‡πà‡∏≤‡∏ß‡πà‡∏≤‡∏á ‡πÅ‡∏•‡∏∞‡πÄ‡∏õ‡∏•‡∏µ‡πà‡∏¢‡∏ô 'free' ‡πÄ‡∏õ‡πá‡∏ô '0' (‡∏Ñ‡∏≥‡πÉ‡∏ö‡πâ: .str.replace())

In [2]:
df_messy['Cost'] = df_messy['Cost'].str.replace(',', '')
print(df_messy)

df_messy['Cost'] = df_messy['Cost'].str.replace('free', '0')
df_messy

  Ticket_ID        User  Category  Cost         Phone
0       T01    Somsak         H/W  1500  081-222-3333
1       T01      Somsak  Hardware  1500    0812223333
2       T02       mAlEe       S/W  free  081 222 3333
3       T03    wichai    Software   500           NaN
4       T04        SUDA   Network  2500    0891112222
5       T05        mana       h/w  1200  089-111-2222
6       T06      MANA    Software     0    0891112222

  Ticket_ID        User  Category  Cost         Phone
0       T01    Somsak         H/W  1500  081-222-3333
1       T01      Somsak  Hardware  1500    0812223333
2       T02       mAlEe       S/W     0  081 222 3333
3       T03    wichai    Software   500           NaN
4       T04        SUDA   Network  2500    0891112222
5       T05        mana       h/w  1200  089-111-2222
6       T06      MANA    Software     0    0891112222

6. ‡πÇ‡∏à‡∏ó‡∏¢‡πå: ‡∏´‡∏•‡∏±‡∏á‡∏à‡∏≤‡∏Å‡∏Ñ‡∏•‡∏µ‡∏ô‡∏Ç‡πâ‡∏≠ 5 ‡πÅ‡∏•‡πâ‡∏ß ‡∏à‡∏á‡πÅ‡∏õ‡∏•‡∏á‡∏Ñ‡∏≠‡∏•‡∏±‡∏°‡∏ô‡πå Cost ‡πÉ‡∏´‡πâ‡πÄ‡∏õ‡πá‡∏ô‡∏ï‡∏±‡∏ß‡πÄ‡∏•‡∏Ç‡∏à‡∏£‡∏¥‡∏á‡πÜ (Numeric) ‡πÄ‡∏û‡∏∑‡πà‡∏≠‡πÉ‡∏´‡πâ‡∏Ñ‡∏≥‡∏ô‡∏ß‡∏ì‡πÑ‡∏î‡πâ (‡∏Ñ‡∏≥‡πÉ‡∏ö‡πâ: .astype(int))

In [ ]:
df_messy['Cost'] = df_messy['Cost'].astype(int)
df_messy

  Ticket_ID    User  Category  Cost       Phone
0       T01  Somsak  Hardware  1500  0812223333
1       T01  Somsak  Hardware  1500  0812223333
2       T02   Malee  Software     0  0812223333
3       T03  Wichai  Software   500         NaN
4       T04    Suda   Network  2500  0891112222
5       T05    Mana  Hardware  1200  0891112222
6       T06    Mana  Software     0  0891112222

7. ‡πÇ‡∏à‡∏ó‡∏¢‡πå: ‡πÉ‡∏ô‡∏Ñ‡∏≠‡∏•‡∏±‡∏°‡∏ô‡πå Phone ‡∏à‡∏á‡∏•‡∏ö‡πÄ‡∏Ñ‡∏£‡∏∑‡πà‡∏≠‡∏á‡∏´‡∏°‡∏≤‡∏¢ - ‡πÅ‡∏•‡∏∞ ‡∏ä‡πà‡∏≠‡∏á‡∏ß‡πà‡∏≤‡∏á ‡∏≠‡∏≠‡∏Å‡πÉ‡∏´‡πâ‡∏´‡∏°‡∏î ‡πÄ‡∏û‡∏∑‡πà‡∏≠‡πÉ‡∏´‡πâ‡πÄ‡∏´‡∏•‡∏∑‡∏≠‡πÅ‡∏ï‡πà‡∏ï‡∏±‡∏ß‡πÄ‡∏•‡∏Ç‡∏ï‡∏¥‡∏î‡∏Å‡∏±‡∏ô (‡πÄ‡∏ä‡πà‡∏ô 0812223333)

In [ ]:
# ‡∏ß‡∏¥‡∏ò‡∏µ‡∏ò‡∏£‡∏£‡∏°‡∏î‡∏≤
# df_messy['Phone'] = df_messy['Phone'].str.replace('-', '').str.replace(' ', '')

# ‡∏ß‡∏¥‡∏ò‡∏µ‡∏°‡∏∑‡∏≠‡∏≠‡∏≤‡∏Ç‡∏µ‡∏û
df_messy['Phone'] = df_messy['Phone'].str.replace(r'[-=()$%# ]', '', regex=True)


df_messy

C:\Users\User\AppData\Local\Temp\ipykernel_18080\430448068.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_messy['Phone'] = df_messy['Phone'].str.replace(r'[-=()$%# ]', '', regex=True)

  Ticket_ID    User  Category  Cost       Phone
0       T01  Somsak  Hardware  1500  0812223333
2       T02   Malee  Software     0  0812223333
3       T03  Wichai  Software   500     NoPhone
4       T04    Suda   Network  2500  0891112222
5       T05    Mana  Hardware  1200  0891112222
6       T06    Mana  Software     0  0891112222


‡∏´‡∏°‡∏ß‡∏î: ‡∏Å‡∏≤‡∏£‡∏à‡∏±‡∏î‡∏Å‡∏≤‡∏£‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡∏ã‡πâ‡∏≥‡πÅ‡∏•‡∏∞‡∏Ñ‡πà‡∏≤‡∏ß‡πà‡∏≤‡∏á (Duplicates & NaN) 

8. ‡πÇ‡∏à‡∏ó‡∏¢‡πå: ‡∏•‡∏ö‡πÅ‡∏ñ‡∏ß‡∏ó‡∏µ‡πà‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡∏ã‡πâ‡∏≥‡∏Å‡∏±‡∏ô‡∏≠‡∏≠‡∏Å (Duplicate Rows) ‡πÇ‡∏î‡∏¢‡∏¢‡∏∂‡∏î‡∏à‡∏≤‡∏Å Ticket_ID (‡∏Ñ‡∏≥‡πÉ‡∏ö‡πâ: .drop_duplicates(subset=['Ticket_ID'])) 

üí° ‡πÄ‡∏Å‡∏£‡πá‡∏î‡∏Ñ‡∏ß‡∏≤‡∏°‡∏£‡∏π‡πâ‡πÄ‡∏û‡∏¥‡πà‡∏°‡πÉ‡∏´‡πâ‡∏õ‡πã‡∏≤:
‡πÉ‡∏ô‡∏Å‡∏≤‡∏£‡πÉ‡∏ä‡πâ‡∏á‡∏≤‡∏ô‡∏à‡∏£‡∏¥‡∏á ‡∏õ‡πã‡∏≤‡∏™‡∏≤‡∏°‡∏≤‡∏£‡∏ñ‡πÄ‡∏•‡∏∑‡∏≠‡∏Å‡πÑ‡∏î‡πâ‡∏ß‡πà‡∏≤‡∏à‡∏∞‡πÄ‡∏Å‡πá‡∏ö‡πÅ‡∏ñ‡∏ß‡πÑ‡∏´‡∏ô‡πÑ‡∏ß‡πâ ‡πÇ‡∏î‡∏¢‡πÉ‡∏ä‡πâ‡∏ï‡∏±‡∏ß‡πÅ‡∏õ‡∏£ keep:

keep='first' (‡∏Ñ‡πà‡∏≤‡πÄ‡∏£‡∏¥‡πà‡∏°‡∏ï‡πâ‡∏ô): ‡πÄ‡∏Å‡πá‡∏ö‡πÅ‡∏ñ‡∏ß‡∏ö‡∏ô‡∏™‡∏∏‡∏î‡πÑ‡∏ß‡πâ ‡∏•‡∏ö‡πÅ‡∏ñ‡∏ß‡∏ó‡∏µ‡πà‡πÄ‡∏´‡∏•‡∏∑‡∏≠

keep='last': ‡πÄ‡∏Å‡πá‡∏ö‡πÅ‡∏ñ‡∏ß‡∏•‡πà‡∏≤‡∏á‡∏™‡∏∏‡∏î‡πÑ‡∏ß‡πâ ‡∏•‡∏ö‡πÅ‡∏ñ‡∏ß‡∏ó‡∏µ‡πà‡∏≠‡∏¢‡∏π‡πà‡∏Å‡πà‡∏≠‡∏ô‡∏´‡∏ô‡πâ‡∏≤

keep=False: ‡∏•‡∏ö‡∏≠‡∏≠‡∏Å‡∏ó‡∏±‡πâ‡∏á‡∏´‡∏°‡∏î‡πÄ‡∏•‡∏¢ ‡πÑ‡∏°‡πà‡πÄ‡∏´‡∏•‡∏∑‡∏≠‡πÅ‡∏°‡πâ‡πÅ‡∏ï‡πà‡πÅ‡∏ñ‡∏ß‡πÄ‡∏î‡∏µ‡∏¢‡∏ß (‡πÉ‡∏ä‡πâ‡∏Å‡∏£‡∏ì‡∏µ‡∏≠‡∏¢‡∏≤‡∏Å‡∏´‡∏≤‡πÄ‡∏â‡∏û‡∏≤‡∏∞‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡∏ó‡∏µ‡πà‡πÑ‡∏°‡πà‡πÄ‡∏Ñ‡∏¢‡∏ã‡πâ‡∏≥‡πÄ‡∏•‡∏¢‡∏à‡∏£‡∏¥‡∏á‡πÜ)

In [ ]:
df_messy = df_messy.drop_duplicates(subset=['Ticket_ID'])
df_messy

  Ticket_ID    User  Category  Cost       Phone
0       T01  Somsak  Hardware  1500  0812223333
2       T02   Malee  Software     0  0812223333
3       T03  Wichai  Software   500         NaN
4       T04    Suda   Network  2500  0891112222
5       T05    Mana  Hardware  1200  0891112222
6       T06    Mana  Software     0  0891112222


9. ‡πÇ‡∏à‡∏ó‡∏¢‡πå: ‡∏ï‡∏£‡∏ß‡∏à‡∏™‡∏≠‡∏ö‡∏ß‡πà‡∏≤‡∏Ñ‡∏≠‡∏•‡∏±‡∏°‡∏ô‡πå Phone ‡∏°‡∏µ‡∏Ñ‡πà‡∏≤‡∏ß‡πà‡∏≤‡∏á (NaN) ‡∏´‡∏£‡∏∑‡∏≠‡πÑ‡∏°‡πà ‡∏ñ‡πâ‡∏≤‡∏°‡∏µ‡πÉ‡∏´‡πâ‡πÄ‡∏ï‡∏¥‡∏°‡∏Ñ‡∏≥‡∏ß‡πà‡∏≤ 'No Phone' ‡∏•‡∏á‡πÑ‡∏õ (‡∏Ñ‡∏≥‡πÉ‡∏ö‡πâ: .fillna())

In [ ]:
df_messy['Phone'] = df_messy['Phone'].fillna('No Phone')
df_messy

C:\Users\User\AppData\Local\Temp\ipykernel_18080\437051365.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_messy['Phone'] = df_messy['Phone'].fillna('No Phone')

  Ticket_ID    User  Category  Cost       Phone
0       T01  Somsak  Hardware  1500  0812223333
2       T02   Malee  Software     0  0812223333
3       T03  Wichai  Software   500    No Phone
4       T04    Suda   Network  2500  0891112222
5       T05    Mana  Hardware  1200  0891112222
6       T06    Mana  Software     0  0891112222


‡∏´‡∏°‡∏ß‡∏î: ‡∏™‡∏£‡∏∏‡∏õ‡∏ú‡∏•‡∏´‡∏•‡∏±‡∏á‡∏Ñ‡∏•‡∏µ‡∏ô (Final Check) 

10. ‡πÇ‡∏à‡∏ó‡∏¢‡πå: ‡∏´‡∏•‡∏±‡∏á‡∏à‡∏≤‡∏Å‡∏ó‡∏≥‡∏ó‡∏∏‡∏Å‡∏Ç‡πâ‡∏≠‡∏Ç‡πâ‡∏≤‡∏á‡∏ö‡∏ô‡πÅ‡∏•‡πâ‡∏ß ‡∏à‡∏á‡∏´‡∏≤ ‡∏¢‡∏≠‡∏î‡∏£‡∏ß‡∏°‡∏Ñ‡πà‡∏≤‡∏ã‡πà‡∏≠‡∏° (Cost) ‡∏ó‡∏±‡πâ‡∏á‡∏´‡∏°‡∏î (‡∏ñ‡πâ‡∏≤‡∏õ‡πã‡∏≤‡πÅ‡∏õ‡∏•‡∏á‡πÄ‡∏õ‡πá‡∏ô‡πÄ‡∏•‡∏Ç‡∏™‡∏≥‡πÄ‡∏£‡πá‡∏à ‡∏Ç‡πâ‡∏≠‡∏ô‡∏µ‡πâ‡∏à‡∏∞‡∏Ñ‡∏≥‡∏ô‡∏ß‡∏ì‡πÑ‡∏î‡πâ‡∏Ñ‡∏£‡∏±‡∏ö)

In [ ]:
total_cost = df_messy['Cost'].sum()
print(f'‡∏¢‡∏≠‡∏î‡∏Ñ‡πà‡∏≤‡∏ã‡πà‡∏≠‡∏°‡∏£‡∏ß‡∏°‡∏ó‡∏±‡πâ‡∏á‡∏´‡∏°‡∏î‡∏Ñ‡∏∑‡∏≠: {total_cost} ‡∏ö‡∏≤‡∏ó')

‡∏¢‡∏≠‡∏î‡∏Ñ‡πà‡∏≤‡∏ã‡πà‡∏≠‡∏°‡∏£‡∏ß‡∏°‡∏ó‡∏±‡πâ‡∏á‡∏´‡∏°‡∏î‡∏Ñ‡∏∑‡∏≠: 5700 ‡∏ö‡∏≤‡∏ó